Инвентаризация_IT/src/Catalogs/Компьютеры/Компьютеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Компьютеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процессор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОЗУ</name>
    <type>
      <types>EnumRef.ТипыОзу</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОЗУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТонкийКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияОборудования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЖесткиеДиски</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПамяти</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипНакопителя</name>
      <type>
        <types>EnumRef.ТипыНакопителей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Устройства</name>
    <attributes>
      <name>Устройство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СетевойАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MacАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Периферия</name>
  </tabularSections>
  <tabularSections>
    <name>ПрограммноеОбеспечение</name>
  </tabularSections>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/ВидыОборудования/ВидыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОборудования</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Видеорегистратор</name>
      <description>Видеорегистратор</description>
    </items>
    <items>
      <name>Камера</name>
      <description>Камера</description>
    </items>
    <items>
      <name>Картридж</name>
      <description>Картридж</description>
    </items>
    <items>
      <name>Монитор</name>
      <description>Монитор</description>
    </items>
    <items>
      <name>СистемныйБлок</name>
      <description>Системный блок</description>
    </items>
    <items>
      <name>Принтер</name>
      <description>Принтер</description>
    </items>
    <items>
      <name>ПринтерЭтикеток</name>
      <description>Принтер этикеток</description>
    </items>
    <items>
      <name>ТерминалСбораДанных</name>
      <description>Терминал сбора данных</description>
    </items>
    <items>
      <name>СистемныйБлокТонкийКлиент</name>
      <description>Системный блок (тонкий клиент)</description>
    </items>
  </predefined>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/Компьютеры/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если ВидОборудования = Справочники.ВидыОборудования.СистемныйБлок Тогда
		Префикс = "ИТ-ПК";
	Иначе
		 Если ВидОборудования = Справочники.ВидыОборудования.СистемныйБлокТонкийКлиент Тогда
		 	 Префикс = "ИТ-ТК";
		 КонецЕсли;
	КонецЕсли;	 
КонецПроцедуры
